<?php
use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{
    /*** Run the database seeds.** @return void*/
    public function run()
    {
        $permissions = [
            "الفواتير",
            "قائمة الفواتير",
            "الفواتير المدفوعة",
            "الفواتير المدفوعة جزئيا",
            "الفواتير الغير مدفوعة",
            "أرشيف الفواتير",
            "اضافة فاتورة",
            "حذف فاتورة",
            "عرض فاتورة",
            "تصدير Excel",
            "تغير حالة الدفع",
            "تعديل الفاتورة",
            "اضافة مرفق",
            "حذف مرفق",

            "التقارير",
            "تقرير الفواتير",
            "تقرير العملاء",

            "المستخدمين",
            "قائمة المستخدمين",
            "اضافة مستخدم",
            "تعديل مستخدم",
            "حذف مستخدم",
            
            "صلاحيات المستخدمين",
            "عرض صلاحية",
            "اضافة صلاحية",
            "تعديل صلاحية",
            "حذف صلاحية",
            
            "الاعدادات",
            
            "المنتجات",
            "اضافة منتج",
            "تعديل منتج",
            "حذف منتج",
            
            "الأقسام",
            "اضافة قسم",
            "تعديل قسم",
            "حذف قسم",

            "الاشعارات"

        ];

        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission]);
        }
    }
}
